const int zCWorld_DIMENSION = 3; //achwas
const int zCWorld_VobHashTable_Offset = 600; //0x0258
const int VOB_HASHTABLE_SIZE = 2048;

// preliminary analysis
struct TraceFlags {
	uint32_t onlyDynamic      : 1; // 1
	uint32_t ignoreVobs       : 1; // 2
	uint32_t unk              : 2; // 4, 8
	uint32_t ignoreStatPoly   : 1; // 0x10
	uint32_t findStatic       : 1; // 0x20
	uint32_t findPortals      : 1; // 0x40
	uint32_t polyNormal       : 1; // 0x80
	uint32_t ignoreTranspPoly : 1; // 0x100
	uint32_t findWaterPoly    : 1; // 0x200
	uint32_t poly2Sided       : 1; // 0x400
	uint32_t ignoreCharacter  : 1; // 0x800
	uint32_t firstHit         : 1; // 0x1000
	uint32_t ignoreVisual     : 1; // 0x2000
	uint32_t ignoreProjetiles : 1; // 0x4000
};

class zTTraceRayReport  {
	zBOOL      foundHit;
	zCVob*     foundVob;
	zCPolygon* foundPoly;
	zVEC3      foundIntersection;
	zVEC3      foundPolyNormal;
	zCVertex*  foundVertex;
};


class zCWorld : zCObject {
	Z_OBJECT(zCWorld);
private:
	zBOOL showTextureStats;
	zBOOL s_bWaveAnisEnabled;
	zBOOL s_bFadeOutFarVerts;
public:
	static void SetShowTextureStats(int b)
	{
		zCWorld::showTextureStats = b;
	}

	static zBOOL GetShowTextureStats()
	{
		return showTextureStats;
	}

	static void SetWaveAnisEnabled(int b)
	{
		zCWorld::s_bWaveAnisEnabled = b;
	}

	static zBOOL GetWaveAnisEnabled()
	{
		return s_bWaveAnisEnabled;
	}

	static void AdvanceClock(float delta)
	{
		if ( delta >= 0.0 ) {
			ztimer.SetFrameTime(delta * 1000.0);
		} else {
			ztimer.ResetTimer();
		}
	} 

	zCWorld();
	virtual ~zCWorld();

	void Archive(zCArchiver& arc) override;
	void Unarchive(zCArchiver& arc) override;

